Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: Add *libname* to the list of libraries that will be included in all links driven by this compiler object. Note that *libname* should \*not\* be the name of a file containing a library, but the name of the library itself: the actual filename will be inferred by the linker, the compiler, or the compiler class (depending on the platform).
pl: Dodaj *libname* do listy bibliotek, które zostaną załączona we wszystkich złączeniach źródeł przeprowadzonych przez ten przedmiot kompilatora. Zauważ, że *libname* \*nie\* powinien być nazwą pliku zawierającego bibliotekę, ale nazwą biblioteki samą w sobie: konkretna nazwa pliku zostanie wywiedziona przez program łączący źródła, kompilator lub uogólnienie kompilatora (w zależności od maszyny/środowiska).

source: The linker will be instructed to link against libraries in the order they were supplied to :meth:`add_library` and/or :meth:`set_libraries`. It is perfectly valid to duplicate library names; the linker will be instructed to link against libraries as many times as they are mentioned.
pl: Program łączący będzie miał za zadanie łączyć z bibliotekami w kolejności w jakiej zostały mu dostarczone do :meth:`add_library` i/lub :meth:`set_libraries`. Jest to całkowicie na miejscu duplikować nazwy bibliotek; program łączący zostanie pokierowany aby łączyć z bibliotekami tak wiele razy jak są one wymienione.

source: Set the list of libraries to be included in all links driven by this compiler object to *libnames* (a list of strings). This does not affect any standard system libraries that the linker may include by default.
pl: Ustaw listę bibliotek do podłączenia we wszystkich złączeniach prowadzonych przez ten przedmiot kompilatora na *libnames* (listę ciągów znaków). Nie wpływa to na żadne standardowe systemowe biblioteki które program łączący mógł załączyć automatycznie.

source: Add *dir* to the list of directories that will be searched for libraries specified to :meth:`add_library` and :meth:`set_libraries`. The linker will be instructed to search for libraries in the order they are supplied to :meth:`add_library_dir` and/or :meth:`set_library_dirs`.
pl: Dodaj katalog *dir* do listy katalogów które będą przeszukiwane pod kątem bibliotek wyszczególnionych dla sposobów postępowania :meth:`add_library` i :meth:`set_libraries`. Program łączący pliki źródłowe zostanie poprowadzony aby poszukiwał bibliotek w kolejności w której są one dostarczone do sposobów postępowania :meth:`add_library_dir` i/lub :meth:`set_library_dirs`.

source: Set the list of library search directories to *dirs* (a list of strings). This does not affect any standard library search path that the linker may search by default.
pl: Ustal listę katalogów poszukiwań bibliotek na *dirs* (listę ciągów znaków). To nie wpływa na żadną standardową ścieżkę poszukiwania bibliotek którą program łączący mógłby poszukiwać domyślnie.

source: Add *dir* to the list of directories that will be searched for shared libraries at runtime.
pl: Dodaj katalog ( z ang. - *dir*) do listy katalogów które będą przeszukiwane pod kątem współdzielonych bibliotek w czasie wykonywania programu po skompilowaniu go do postaci wynikowej.

source: Set the list of directories to search for shared libraries at runtime to *dirs* (a list of strings). This does not affect any standard search path that the runtime linker may search by default.
pl: Ustaw listę katalogów do przeszukania na obecność współdzielonych bibliotek w czasie wykonania wynikowego programu na *dirs* ( - z ang. katalogi) (w postaci listy ciągów znaków). To nie wpływa na żadne standardowe ścieżki poszukiwań, które program łączący z programem wynikowym mógłby poszukiwać domyślnie.

source: Define a preprocessor macro for all compilations driven by this compiler object. The optional parameter *value* should be a string; if it is not supplied, then the macro will be defined without an explicit value and the exact outcome depends on the compiler used (XXX true? does ANSI say anything about this?)
pl: Zdefiniuj makropolecenie preprocesora dla wszystkich kompilacji prowadzonych przez obiekt kompilatora. Opcjonalny parametr *value* ( - z ang. - wartość) powinien być ciągiem znaków; jeśli nie jest dostarczony, wtedy makropolecenie będzie zdefiniowane bez jawnej wartości i konkretny wynik zależeć będzie on użytego kompilatora (XXX na prawdę? czy ANSI mówi coś na ten temat?)

source: Undefine a preprocessor macro for all compilations driven by this compiler object. If the same macro is defined by :meth:`define_macro` and undefined by :meth:`undefine_macro` the last call takes precedence (including multiple redefinitions or undefinitions). If the macro is redefined/undefined on a per-compilation basis (ie. in the call to :meth:`compile`), then that takes precedence.
pl: Wyłącz makrodefinicję preprocesora dla wszystkich kompilacji prowadzonych przez ten obiekt kompilujący. Jeśli ta sama makrodefinicja jest zdefiniowana przez sposób postępowania :meth:`define_macro` i odłączane przez :meth:`undefine_macro` ostatnie wywołanie ma pierwszeństwo (włączając w to wielokrotnie powtarzane redefinicje i odwołania definicji). Jeśli makrodefinicja jest ponownie definiowane/odwoływane za każdym razem gdy następuje nowa kompilacja (tj. w momencie wywołania sposobu postępowania :meth:`compile`), wtedy to ostatnie ma pierwszeństwo.

source: Add *object* to the list of object files (or analogues, such as explicitly named library files or the output of "resource compilers") to be included in every link driven by this compiler object.
pl: Dodaj *przedmiot* do listy plików przedmiotów (lub analogów, takich jak jawnie nazwane pliki bibliotek lub wyjście "kompilatora zasobów") aby był załączony w każdym złączeniu źródeł prowadzonym przez ten obiekt kompilacji.

source: Set the list of object files (or analogues) to be included in every link to *objects*. This does not affect any standard object files that the linker may include by default (such as system libraries).
pl: Ustaw listę plików przedmiotów (lub analogów) aby były załączane w każdym łączu do *przedmiotów* (z ang. - *objects*). To nie wpływa na żadne standardowe pliki przedmiotów które program łączący mógłby załączać automatycznie (takich jak biblioteki systemowe).

source: The following methods implement methods for autodetection of compiler options, providing some functionality similar to GNU :program:`autoconf`.
pl: Następujące sposoby postępowania wypełniają sposoby postępowania dla automatycznego wykrywania opcji kompilatora, dostarczając pewnych użyteczności podobnych do programu GNU :program:`autoconf`.

source: Detect the language of a given file, or list of files. Uses the instance attributes :attr:`language_map` (a dictionary), and :attr:`language_order` (a list) to do the job.
pl: Wykryj język danego pliku, lub listy plików, Używa właściwości przykładu :attr:`language_map` (słownika) i :attr:`language_order` (listy) aby wykonać co należy.

source: Search the specified list of directories for a static or shared library file *lib* and return the full path to that file. If *debug* is true, look for a debugging version (if that makes sense on the current platform). Return ``None`` if *lib* wasn't found in any of the specified directories.
pl: Przeszukaj wyszczególnioną listę katalogów na obecność pliku statycznej lub współdzielonej biblioteki *lib* i zwraca pełną ścieżkę do tego pliku. Jeśli *debug* jest prawdziwy, poszukaj wersji debugującej (jeśli ma to sens na obecnej maszynie/środowisku). Zwróć ``Żaden`` ( - z ang. - ``None`` ) jeśli biblioteka *lib* nie została znaleziona w żadnym z określonych katalogów.

source: Return a boolean indicating whether *funcname* is supported on the current platform. The optional arguments can be used to augment the compilation environment by providing additional include files and paths and libraries and paths.
pl: Zwróć wartość typu boolean (prawda/fałsz) wskazującą czy *funcname* - z ang. nazwa zadania jest wspierana na obecnej maszynie/środowisku. Opcjonalne parametru mogą być użyte aby wzbogacić środowisko kompilacji przez dostarczenie dodatkowych plików źródłowych do załączenia i ścieżek dostępu do nich i bibliotek i ścieżek dostępu do nich.

source: Return the compiler option to add *dir* to the list of directories searched for libraries.
pl: Zwróć opcję kompilatora aby dodać katalog - *dir* do listy katalogów przeszukiwanych pod kątem bibliotek.

source: Return the compiler option to add *dir* to the list of libraries linked into the shared library or executable.
pl: Zwróć opcję kompilatora dodającą katalog - *dir* do listy bibliotek załączonych do współdzielonej biblioteki lub pliku wykonywalnego.

source: Return the compiler option to add *dir* to the list of directories searched for runtime libraries.
pl: Zwróć opcję kompilatora dodającą katalog - *dir* do listy katalogów poszukiwań bibliotek czasu wykonania.

source: Define the executables (and options for them) that will be run to perform the various stages of compilation. The exact set of executables that may be specified here depends on the compiler class (via the 'executables' class attribute), but most will have:
pl: Określ pliki wykonywalne (i opcje dla nich) które będą uruchamiane aby wykonać różne kroki kompilacji. Dokładny zbiór plików wykonywalnych, który może być tutaj określony zależy od uogólnienia kompilatora (przez właściwość - uogólnienie 'executables' - z ang. - wykonywalne), ale większość będzie miała:

source: attribute
pl: właściwość

source: the C/C++ compiler
pl: kompilator C/C++

source: linker used to create shared objects and libraries
pl: program łączący używany do tworzenia współdzielonych przedmiotów i bibliotek

source: linker used to create binary executables
pl: program łączący używany do tworzenia binariów wykonywalnych - programów w kodzie maszynowym

source: static library creator
pl: kreator statycznych bibliotek

source: On platforms with a command-line (Unix, DOS/Windows), each of these is a string that will be split into executable name and (optional) list of arguments. (Splitting the string is done similarly to how Unix shells operate: words are delimited by spaces, but quotes and backslashes can override this. See :func:`distutils.util.split_quoted`.)
pl: Na platformach z linią komend (Unix, DOS/Windows), każdy z tych jest ciągiem, który będzie podzielony na nazwę programu wykonywalnego i (opcjonalną) listę parametrów. (Podział ciągu znaków dokonywany jest podobnie do tego, jak działają powłoki Unixa: słowa są zakańczane spacjami, ale cudzysłowy i skośniki mogą pomóc to obejść. Zobacz :func:`distutils.util.split_quoted`.)

source: The following methods invoke stages in the build process.
pl: Następujące sposoby postępowania wywołują stadia procesu budowania ze źródeł.

source: Compile one or more source files. Generates object files (e.g. transforms a :file:`.c` file to a :file:`.o` file.)
pl: Kompiluje jeden lub więcej plików źródłowych. Generuje pliki przedmiotowe (np. zamienia plik :file:`.c` na plik :file:`.o`.)

source: *sources* must be a list of filenames, most likely C/C++ files, but in reality anything that can be handled by a particular compiler and compiler class (eg. :class:`MSVCCompiler` can handle resource files in *sources*). Return a list of object filenames, one per source filename in *sources*. Depending on the implementation, not all source files will necessarily be compiled, but all corresponding object filenames will be returned.
pl: *źródła* - z ang. - *sources* muszą być listą nazw plików, najprawdopodobniej pliki C/C++, ale w rzeczywistości wszystko co może być obsłużone przez konkretny kompilator i uogólnienie kompilatora (np. :class:`MSVCCompiler` może obsłużyć pliki zasobów w źródłach - z ang. - *sources*. W zależności od wypełnienia, nie wszystkie pliki źródłowe koniecznie będą kompilowane, ale wszystkie odpowiadające nazwy plików przedmiotów będą zwrócone.

source: If *output_dir* is given, object files will be put under it, while retaining their original path component. That is, :file:`foo/bar.c` normally compiles to :file:`foo/bar.o` (for a Unix implementation); if *output_dir* is *build*, then it would compile to :file:`build/foo/bar.o`.
pl: Jeśli *output_dir* ( z ang. - katalog wyjściowy) jest dany, pliki przedmiotowe zostaną do niego włożone, zachowując ich oryginalne ścieżki. To jest, plik :file:`foo/bar.c` normalnie kompilowany jest do pliku :file:`foo/bar.o` (dla wypełnienia Unixowego); jeśli *output_dir* jest *build*, wtedy to skompilowane byłoby do :file:`build/foo/bar.o`.

source: *macros*, if given, must be a list of macro definitions. A macro definition is either a ``(name, value)`` 2-tuple or a ``(name,)`` 1-tuple. The former defines a macro; if the value is ``None``, the macro is defined without an explicit value. The 1-tuple case undefines a macro. Later definitions/redefinitions/undefinitions take precedence.
pl: *macros*, jeśli podane, muszą być listą makrodefinicji. Makrodefinicja jest albo 2-krotką ``(name, value)`` lub 1-krotką ``(name,)``. Pierwsze określa makrodefinicję; jeśli wartość jest ``Żadna`` - z ang. - ``None``, wtedy makro jest zdefiniowane bez jawnej wartości. 1-krotka odwołuje makrodefinicję. Później definicje/powtórne definicje/odwołania definicji mają pierwszeństwo.

source: *include_dirs*, if given, must be a list of strings, the directories to add to the default include file search path for this compilation only.
pl: *include_dirs*, jeśli podane, muszą być listą ciągów znaków, katalogami do dodania do domyślnych ścieżek załączania plików źródłowych wyłącznie dla tej kompilacji.

source: *debug* is a boolean; if true, the compiler will be instructed to output debug symbols in (or alongside) the object file(s).
pl: *debug* jest wartością boolowską (z ang. - boolean od nazwiska); jeśli prawdziwa kompilator będzie wykonywał polecenie wypuszczania symboli debugowania do (lub obok) pliku przedmiotowego ( - z ang. - object file) lub plików.

source: *extra_preargs* and *extra_postargs* are implementation-dependent. On platforms that have the notion of a command-line (e.g. Unix, DOS/Windows), they are most likely lists of strings: extra command-line arguments to prepend/append to the compiler command line. On other platforms, consult the implementation class documentation. In any event, they are intended as an escape hatch for those occasions when the abstract compiler framework doesn't cut the mustard.
pl: *extra_preargs* i *extra_postargs* są zależne od wypełnienia. Na maszynach, które respektują pojęcie wiersza poleceń (np. Unix, DOS/Windows), są one najpewniej listami ciągów znaków: dodatkowe parametry wiersza poleceń do wstawiania przed/dokładania na koniec wiersza poleceń kompilatora. Na innych maszynach, zobacz dokumentację wypełnienia uogólnień. W każdym przypadku, są one przeznaczone jako wyjście awaryjne na te okazje gdy ramy abstrakcyjnego kompilatora nie są w stanie pomieścić tego co trzeba.

source: *depends*, if given, is a list of filenames that all targets depend on. If a source file is older than any file in depends, then the source file will be recompiled. This supports dependency tracking, but only at a coarse granularity.
pl: *depends* - z ang. - *zależy*, jeśli podane lista nazw plików, od których wszystkie cele zależą. Jeśli źródłowy plik jest starszy niż dowolny plik w tej liście, wtedy plik źródłowy zostanie powtórnie skompilowany. To wspiera śledzenie zależności, ale tylko w zgrubnej skali wielkości.

source: Raises :exc:`CompileError` on failure.
pl: Zgłasza :exc:`CompileError` na błędzie.

source: Link a bunch of stuff together to create a static library file. The "bunch of stuff" consists of the list of object files supplied as *objects*, the extra object files supplied to :meth:`add_link_object` and/or :meth:`set_link_objects`, the libraries supplied to :meth:`add_library` and/or :meth:`set_libraries`, and the libraries supplied as *libraries* (if any).
pl: Połącz (powiąż) wiechcie przedmiotów razem aby stworzyć plik statycznej biblioteki. "Wiechcie przedmiotów" składają się z listy plików przedmiotów dostarczonych jak *przedmioty* ( - z ang. - *objects*), dodatkowe pliki przedmiotów dostarczone do :meth:`add_link_object` i/lub :meth:`set_link_objects`, biblioteki dostarczone do :meth:`add_library` i/lub :meth:`set_libraries`, i biblioteki dostarczone jako *biblioteki* (jeśli jakiekolwiek).

source: *output_libname* should be a library name, not a filename; the filename will be inferred from the library name. *output_dir* is the directory where the library file will be put. XXX defaults to what?
pl: *output_libname* powinien być nazwą biblioteki, nie nazwą pliku; nazwa pliku będzie wywiedziona z nazwy biblioteki. *output_dir* jest katalogiem gdzie plik biblioteki będzie włożony. XXX jaka jest wartość domyślna?

source: *debug* is a boolean; if true, debugging information will be included in the library (note that on most platforms, it is the compile step where this matters: the *debug* flag is included here just for consistency).
pl: *debug* jest typu boolowskiego (z ang. - boolean); jeśli prawdziwa informacja o odpluskwianiu będzie załączana do biblioteki (zauważ, że w większości maszyn/środowisk, to jest krok kompilacji gdzie ma to znaczenie: flaga *debug* użyta jest tu dla spójności).

source: *target_lang* is the target language for which the given objects are being compiled. This allows specific linkage time treatment of certain languages.
pl: *target_lang* jest docelowym językiem dla którego dane przedmioty są kompilowane. To pozwala na specjalne traktowanie w czasie łączenia dla niektórych języków.

source: Raises :exc:`LibError` on failure.
pl: Zgłasza :exc:`LibError` w razie błędu.

source: Link a bunch of stuff together to create an executable or shared library file.
pl: Łączy wiecheć rzeczy razem żeby stworzyć plik wykonywalny lub współdzielony plik biblioteki.

source: The "bunch of stuff" consists of the list of object files supplied as *objects*. *output_filename* should be a filename. If *output_dir* is supplied, *output_filename* is relative to it (i.e. *output_filename* can provide directory components if needed).
pl: "wiecheć rzeczy" składa się z listy przedmiotowych plików dostarczonych jako *przedmioty* ( - z ang. - *objects*) . *output_filename* powinno być nazwą pliku. Jeśli *output_dir* jest dostarczony, *output_filename* jest zależny od niego (tj. *output_filename* może dostarczać składowe katalogów jeśli potrzeba).

source: *libraries* is a list of libraries to link against. These are library names, not filenames, since they're translated into filenames in a platform-specific way (eg. *foo* becomes :file:`libfoo.a` on Unix and :file:`foo.lib` on DOS/Windows). However, they can include a directory component, which means the linker will look in that specific directory rather than searching all the normal locations.
pl: *libraries* jest listą bibliotek do podłączenia. Są to nazwy bibliotek, nie nazwy plików, gdyż są tłumaczone na nazwy plików w zależny od maszyny/środowiska sposób (np. *foo* staje się :file:`libfoo.a` w Unixie i :file:`foo.lib` w DOS/Windows). Jednakże mogą zawierać składnik katalogu który oznacza że program łączący biblioteki będzie poszukiwał w tym szczególnym katalogu zamiast przeszukiwać wszystkie zwykłe lokalizacje.

source: *library_dirs*, if supplied, should be a list of directories to search for libraries that were specified as bare library names (ie. no directory component). These are on top of the system default and those supplied to :meth:`add_library_dir` and/or :meth:`set_library_dirs`. *runtime_library_dirs* is a list of directories that will be embedded into the shared library and used to search for other shared libraries that \*it\* depends on at run-time. (This may only be relevant on Unix.)
pl: *library_dirs*, jeśli dostarczono, powinno być listą katalogów do przeszukania w poszukiwaniu bibliotek które zostały określone jako skąpe nazwy bibliotek (tj. bez składnika katalogu). Te są na wierzchu domyślnych dla systemu i tych dostarczonych do sposobów postępowania :meth:`add_library_dir` i/lub :meth:`set_library_dirs`. *runtime_library_dirs* jest listą katalogów które będą załączone do współdzielonej biblioteki i użyte do przeszukania pod kątem innych współdzielonych bibliotek od których \*one\* zależą w czasie-wykonania. (To może być istotne tylko w Unixie.)

source: *export_symbols* is a list of symbols that the shared library will export. (This appears to be relevant only on Windows.)
pl: *export_symbols* jest listą symboli które współdzielona biblioteka będzie wystawiać na zewnątrz. (To wydaje się mieć znaczenie tylko w Windows.)

source: *debug* is as for :meth:`compile` and :meth:`create_static_lib`, with the slight distinction that it actually matters on most platforms (as opposed to :meth:`create_static_lib`, which includes a *debug* flag mostly for form's sake).
pl: *debug* jest tak, jak dla sposobu postępowania :meth:`compile` (z ang. - kompiluj) i :meth:`create_static_lib`, z małą różnicą, że ma jednak znaczenie na większości maszyn/środowisk (w przeciwieństwie do :meth:`create_static_lib`, które zawiera flagę *debug* głównie dla zachowania formalności).

source: *extra_preargs* and *extra_postargs* are as for :meth:`compile` (except of course that they supply command-line arguments for the particular linker being used).
pl: *extra_preargs* i *extra_postargs* są takie jak dla sposobu postępowania :meth:`compile` (z wyjątkiem tego, że dostarczają parametry wiersza poleceń dla szczególnego programu łączącego biblioteki będącego w użyciu).

source: Raises :exc:`LinkError` on failure.
pl: Zgłasza :exc:`LinkError` w przypadku wystąpienia błędu.

source: Link an executable. *output_progname* is the name of the file executable, while *objects* are a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
pl: Podłącz plik wykonywalny. *output_progname* jest nazwą pliku wykonywalnego, podczas gdy *objects* jest listą nazw plików przedmiotów do podłączenia. Inne parametry są takie jak dla sposobu postępowania :meth:`link`.

source: Link a shared library. *output_libname* is the name of the output library, while *objects* is a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
pl: Podłącz plik współdzielonej biblioteki. *output_libname* jest nazwą wynikowej biblioteki, podczas gdy *objects* jest listą nazw plików przedmiotów do załączenia. Inne parametry są takie jak dla sposobu postępowania :meth:`link`.

source: Link a shared object. *output_filename* is the name of the shared object that will be created, while *objects* is a list of object filenames to link in. Other arguments are as for the :meth:`link` method.
pl: Podłącz współdzielony przedmiot. *output_filename* jest nazwą współdzielonego przedmiotu który zostanie utworzony, podczas gdy *objects* jest listą nazw plików przedmiotów do załączenia. Inne parametry są takie, jak dla sposobu postępowania :meth:`link`.
